import random
import time
from time import sleep

print("""
██╗░░██╗███████╗██╗░░░░░██╗░░░░░░█████╗░
██║░░██║██╔════╝██║░░░░░██║░░░░░██╔══██╗
███████║█████╗░░██║░░░░░██║░░░░░██║░░██║
██╔══██║██╔══╝░░██║░░░░░██║░░░░░██║░░██║
██║░░██║███████╗███████╗███████╗╚█████╔╝
╚═╝░░╚═╝╚══════╝╚══════╝╚══════╝░╚════╝░
""")

answers = [
    "🎃 Несомненно! 🕯️",
    "🎃 Можете быть уверены! 🕯️",
    "🎃 Ну такое...! 🕯️",
    "🎃 Сложно сказать... 🕯️",
    "🎃 Попробуй ещё раз. 🕯️"
    "🎃 Сомневаюсь в этом... 🕯️",
    ]
alpheng = [
    "A","a","B","b","C","c","D","d","E","e","F","f","G","g","H","h","I","i","J","j","K","k","L","l","M","m","N","n","O","o","P","p","Q","q","R","r","S","s","T","t",
    "U","u","V","v","W","w","X","x","Y","y","Z","z"
]

print('Приветствую, меня зовут PosReady Бот. Выбери дейстивя:')
vote = int(input("1 - Генерация рандомного числа. \n2 - Шар судьбы. \n3 - Генерация пароля. \n4 - калькулятор. \n5 - Моя история ДО создания этого бота\n6 - выход"))
while vote != 6:
    if vote == 1:
        print("Подождите идёт генерация...")
        time.sleep(7)
        print("Сгенерированое число:", random.randint(0, 500))
    if vote == 2:
        shar = input("Скажи свой вопрос шару:")
        if shar != '':
            print(f"Шар: {random.choice(answers)}")
        else:
            print("Вы нажали походу на Enter. Напишите цифру 2 в действии..")
    if vote == 3:
        choice = int(input("Перед тем как начать какой будет вид пароля? \n1 - на числах. \n2 - на буквах (английских)"))
        if choice == 1:
            length = int(input('Введите желаемую длину пароля:'))
            password = ''
            for i in range(length):
                password = password + str(random.randint(0, 500))
            print(password)
            
        if choice == 2:
            length = int(input('Введите желаемую длину пароля:'))
            password = ''
            for i in range(length):
                password = password + str(random.choice(alpheng))
            print(password)
    if vote == 4:
        calc = int(input("Введите 1 число:"))
        calc2 = int(input("Введите 2 число:"))
        calc3 = int(input("Введите цифру оператора: \n1: +\n2: -\n3: /\n4: *"))
        if calc3 == 1:
            print("Подсчёт...")
            time.sleep(3)
            print("Получилось:", (calc+calc2))
        if calc3 == 2:
            print("Подсчёт...")
            time.sleep(3)
            print("Получилось:", (calc-calc2))
        if calc3 == 3:
            print("Подсчёт...")
            time.sleep(3)
            print("Получилось:", (calc/calc2))
        if calc3 == 4:
            print("Подсчёт...")
            time.sleep(3)
            print("Получилось:", (calc*calc2))
    if vote == 5:
        print("Вообще, когда был вроде середина 2020 года. \nЯ пошёл изучать какой то Язык программирования. \nНаткнулся на JS - мне не понравился.\nНакткнулся на Assembler - о-о-очень сложный был,\nчтобы сделать там Hello World слово нужно было\nнаписать больше 60 строк кода.\nНу и нактнулся на Python. Мне понравился. Он был легким,\nподдерживаемым. Кратко говоря он хороший для меня.\nИ сразу же я начал изучать discord.py\n(библиотека такая для создания ботов в discord) Мне было сначала трудно но потом понял и сделал своего бота. Он назывался: Fire Bot\nОн был очень функциональным. Но пока я не решил пересоздать его. И, из-за этого создался бот под названием: PosReady Bot. Я думаю что такая история но очень какая то запутанная...")
        print("Библиотеки которые использовал:")
        print("""### time, random ###""")
    print("######################################")
    vote = int(input("Выбери действия: \n1 - Генерация рандомного числа. \n2 - Шар судьбы. \n3 - Генерация пароля. \n4 - Калькулятор. \n5 - Моя история ДО создания этого бота\n6 - Выход"))
